IDEA StatiCa Open Model
CrossSectionFactory.FillCssSteelAngle Method
Compatible with IDEA StatiCa Beta 21.0 - beta
 Fill steel section of angle shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public static void FillCssSteelAngle(
	CrossSectionParameter css,
	double B,
	double D,
	double t,
	double rw,
	double r2,
	double C,
	bool mirrorZ = false
)
Public Shared Sub FillCssSteelAngle (
	css As CrossSectionParameter,
	B As Double,
	D As Double,
	t As Double,
	rw As Double,
	r2 As Double,
	C As Double,
	Optional mirrorZ As Boolean = false
)
public:
static void FillCssSteelAngle(
	CrossSectionParameter^ css,
	double B,
	double D,
	double t,
	double rw,
	double r2,
	double C,
	bool mirrorZ = false
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
B
Type: System.Double
width
D
Type: System.Double
depth
t
Type: System.Double
thickness
rw
Type: System.Double
root radius
r2
Type: System.Double
toe radius
C
Type: System.Double
centroid position
mirrorZ (Optional)
Type: System.Boolean
profile can be mirrored
Return Value
Type:
Remarks
Dimension of angle section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double B = 0.2;
double D = 0.4;
double t = 0.025;
double rw = 0.004;
double r2 = 0.002;
double C = 0.0;
bool mirrorZ = false;
CrossSectionFactory.FillCssSteelAngle(css, B, D, t, rw, r2, C, mirrorZ);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace